hotRoom4_A/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform 0.1;

boundaryField
{
    wtwalls
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    inlet
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    outlet
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    buildingFaces_master
    {
        type            kqRWallFunction;
        coupleGroup     buildingFaces;
        value           uniform 0.1;
    }
    buildingFaces_slave
    {
        type            kqRWallFunction;
        coupleGroup     buildingFaces;
        value           uniform 0.1;
    }
}


// ************************************************************************* //
