hotRoom4_A/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

fields true;

// Baffles to create.
baffles
{
    buildingFaces
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    building;

        patchPairs
        {
            type            wall;

            patchFields
            {
                epsilon
                {
                    type        epsilonWallFunction;
                    value       uniform 0.01;
                }
                k
                {
                    type        kqRWallFunction;
                    value       uniform 0.1;
                }
                nut
                {
                    type        nutkWallFunction;
                    value       uniform 0;
                }
                p
                {
                    type        zeroGradient;
                }
                U
                {
                    type            noSlip;
                }
                alphat
                {
                    type            alphatJayatillekeWallFunction;
                    Prt             0.85;
                    value           uniform 0;
                }
                p_rgh
                {
                    type            fixedFluxPressure;
                    value           uniform 0;
                    // gradient         rhok;
                    
                }
                T
                {
                    type            zeroGradient;
                }
            }
        }
    }
}

// ************************************************************************* //
